// Прочитайте главу 4 книги Роберта Мартина «Чистый код».
// Выпишите ниже рекомендации по употреблению комментариев в коде.
//
// Рекомендации:
//
//Не закомментировывать код
//Не нужно писать очень длинные комментарии
//Не нужно объяснять весь код программы с помощью комментариев
//Комментарий должен быть понятен всем
//Не рекомендуется компенсировать плохой код комментариями с пояснениями




#include <iostream>

int main() {
    std::cout << "There is no useful output. Read comments" << std::endl;
}
